# Set global configuration arguments
cask_args appdir: "~/Applications"

# Taps
tap "beeftornado/rmtree"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "sambadevi/powerlevel9k"

# Cask dependencies
cask "xquartz"

# Shells
# Note: Don't forget to add shells to `/etc/shells` before running `chsh`.
brew "bash"
brew "zsh"
brew "zsh-completions"

# CLI utilities
brew "antibody" #plugin management for zsh
brew "autojump"
brew "chisel"
brew "curl"
brew "fd" 
brew "fzf"
brew "gh" #github cli tool
brew "git-lfs"
brew "git-when-merged"
brew "git", args: ["with-blk-sha1", "with-gettext", "with-pcre", "with-persistent-https"]
brew "highlight"
brew "pcre"
brew "powerlevel9k" #zsh theme
brew "tree"
brew "wget"
cask "qlstephen" #quick look plugin for text files without extensions

# Install GUI applications
cask "alfred"
cask "atom"
cask "banktivity"
cask "carbon-copy-cloner"
cask "fantastical"
cask "gifs"
cask "gpg-suite"
cask "ImageOptim"
cask "istat-menus"
cask "kaleidoscope"
cask "KextViewr"
cask "keybase"
cask "knockknock"
cask "little-snitch"
cask "monodraw"
cask "Sketch"
cask "skype"
cask "Slack"
cask "sublime-text"
cask "suspicious-package"
cask "TaskExplorer"
cask "the-unarchiver"
cask "tower"
cask "Transmission"
cask "transmit"
cask "Visual-Studio-Code"
cask "vlc"
cask "WhatsYourSign"
cask "xScope"

# Browsers
cask "firefox-nightly"
cask "firefox"
cask "google-chrome-canary"
cask "google-chrome"

# Virtulization applications
cask "parallels-desktop"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-hack"
