# Set global configuration arguments
cask_args appdir: "~/Applications"

# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"

# Cask dependencies
brew "mas"
cask "java"
cask "xquartz"

# Shells
# Note: Don't forget to add shells to `/etc/shells` before running `chsh`.
brew "bash"
brew "zsh"

# CLI utilities
brew "pcre"
brew "git", args: ["with-blk-sha1", "with-gettext", "with-pcre", "with-persistent-https"]
brew "wget"
brew "curl"
brew "autojump"
brew "chisel"

# Programming languages
# Installing Python with Homebrew is unnecessary,
# as they will be installed and managed via pyenv/rbenv respectively
brew "pyenv" # Python

# Install Security GUI Apps
cask "blockblock"
cask "knockknock"
cask "dhs"
cask "taskexplorer"
cask "kextviewr"
cask "suspicious-package"

# Install GUI applications
cask "1password"
cask "alfred"
cask "atom"
cask "banktivity"
cask "daisydisk"
cask "dropbox"
cask "fantastical"
cask "gifs"
cask "goofy"
cask "hipchat"
cask "iterm2"
cask "istat-menus"
cask "kaleidoscope"
cask "monodraw"
cask "moom"
cask "skype"
cask "the-unarchiver"
cask "tower"
cask "tunnelbear"
cask "transmission"
cask "unrarx"
cask "vlc"
cask "viber"

# Browsers
cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"
cask "firefoxnightly"

# Virtulization applications
cask "parallels-desktop"

# Preference Panes
cask "hosts"

# Fonts
cask "font-hack"

# MAS applications
# Get a list of installed MAS apps with:
# `brew bundle dump --file=- | egrep ^mas`
mas "1Blocker", id: 1107421413
mas "Kaleidoscope", id: 587512244
mas "xScope", id: 889428659
mas "Deckset", id: 847496013
mas "Pixelmator", id:407963104
mas "CARROT Weather", id: 993487541
mas "Tweetbot", id: 557168941
mas "Reeder", id: 880001334

# Apple MAS applications
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
