# Set global configuration arguments
cask_args appdir: "~/Applications"

# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "beeftornado/rmtree"

# Cask dependencies
brew "mas"
cask "java"
cask "xquartz"

# Shells
# Note: Don't forget to add shells to `/etc/shells` before running `chsh`.
brew "bash"
brew "zsh"

# CLI utilities
brew "autojump"
brew "chisel"
brew "curl"
brew "fd" 
brew "fzf"
brew "git-lfs"
brew "git-when-merged"
brew "git", args: ["with-blk-sha1", "with-gettext", "with-pcre", "with-persistent-https"]
brew "highlight"
brew "pcre"
brew "tree"
brew "wget"
cask "qlstephen" #quick look plugin for text files without extensions

# Install GUI applications
cask "alfred"
cask "atom"
cask "banktivity"
cask "carbon-copy-cloner"
cask "dropbox"
cask "fantastical"
cask "gifs"
cask "gpg-suite"
cask "hipchat"
cask "ImageOptim"
cask "istat-menus"
cask "kaleidoscope"
cask "KextViewr"
cask "keybase"
cask "knockknock"
cask "little-snitch"
cask "monodraw"
cask "skype"
cask "Sketch"
cask "Slack"
cask "soulver"
cask "sublime-text"
cask "suspicious-package"
cask "TaskExplorer"
cask "the-unarchiver"
cask "tower"
cask "Transmission"
cask "transmit"
cask "tunnelbear"
cask "unrarx"
cask "viber"
cask "Visual-Studio-Code"
cask "vlc"
cask "WhatsYourSign"
cask "xScope"

# Browsers
cask "firefox-nightly"
cask "firefox"
cask "google-chrome-canary"
cask "google-chrome"

# Virtulization applications
cask "parallels-desktop"

# Preference Panes
cask "hosts"

# Fonts
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hack"

# MAS applications
# Get a list of installed MAS apps with:
# `brew bundle dump --file=- | egrep ^mas`
mas "1Blocker", id: 1107421413
mas "CARROT Weather", id: 993487541
mas "DaisyDisk", id: 411643860
mas "Deckset", id: 847496013
mas "Deliveries", id: 924726344
mas "Moom",id: 419330170
mas "Pixelmator", id:407963104
mas "Reeder", id: 880001334
mas "Sequence Diagram", id: 1195426709
mas "Tweetbot", id: 557168941
mas "Twitterrific", id: 1289378661
mas "xScope", id: 889428659

# Apple MAS applications
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
